Repository: satyakommula96/trueledger
Catalog: lib/l10n/app_*.arb
Languages: te

# privacyPrinciple
source: TrueLedger is built on the principle that your financial life is yours alone. We believe in absolute privacy, which is why your data never leaves your device.
te: మీ ఆర్థిక సమాచారం మీది మాత్రమే అనే సూత్రంపై TrueLedger నిర్మించబడింది. మేము సంపూర్ణ గోప్యతను నమ్ముతాము, అందుకే మీ డేటా మీ పరికరాన్ని వదిలి వెళ్ళదు.

source: NO ADS
te: ప్రకటనలు లేవు

# noAdsDesc
source: We never clutter your experience with advertisements or sponsored content.
te: మేము ఎప్పుడూ ప్రకటనలు లేదా ప్రాయోజిత కంటెంట్‌తో మీకు అసౌకర్యం కలిగించము.

source: NO TRACKING
te: ట్రాకింగ్ లేదు

# noTrackingDesc
source: We don't track your behavior, location, or usage. You are not a data point.
te: మేము మీ ప్రవర్తనను, స్థానాన్ని లేదా వినియోగాన్ని ట్రాక్ చేయము. మీరు మాకు కేవలం డేటా పాయింట్ కాదు.

source: NO PROFILING
te: ప్రొఫైలింగ్ లేదు

# noProfilingDesc
source: Your habits are private. Insights & patterns are calculated locally and never sent to external AI servers.
te: మీ ఆర్థిక అలవాట్లు వ్యక్తిగతం. మేము ఎవరినీ టార్గెట్ చేయడానికి ప్రొఫైల్‌లను రూపొందించము.

# localOnly
source: 100% LOCAL
te: 100% లోకల్

# localOnlyDesc
source: Your database exists only on your device. We have no access to your logs.
te: మీ డేటాబేస్ మీ పరికరంలో మాత్రమే ఉంటుంది. మీ లాగ్‌లకు మాకు ఎటువంటి యాక్సెస్ ఉండదు.

# noAnalyticsSdk
source: No analytics or tracking SDKs
te: ఎటువంటి విశ్లేషణ లేదా ట్రాకింగ్ SDKలు లేవు

# noBehaviorProfiling
source: No behavior profiling or scoring
te: ప్రవర్తనా వివరణలు లేదా స్కోరింగ్ లేదు

# noBankScraping
source: No bank or SMS scraping
te: బ్యాంక్ లేదా SMS స్క్రాపింగ్ లేదు

# noCloudSync
source: No cloud sync or external storage
te: క్లౌడ్ సింక్ లేదా బాహ్య స్టోరేజ్ లేదు

# noSellingLogs
source: No selling or sharing of user logs
te: వినియోగదారు లాగ్‌లను అమ్మడం లేదా పంచుకోవడం జరగదు

# noExternalAi
source: NO DATA SENT TO EXTERNAL AI
te: బాహ్య AI కి ఎటువంటి డేటా పంపబడదు

# localProcessingOnly
source: Processing is 100% on-device
te: ప్రాసెసింగ్ 100% మీ పరికరంలోనే జరుగుతుంది

source: DESKTOP ISOLATION
te: డెస్క్‌టాప్ ఐసోలేషన్ (Desktop Isolation)

# desktopIsolationDesc
source: Data is stored in your private user profile only.
te: డేటా మీ ప్రైవేట్ యూజర్ ప్రొఫైల్‌లో మాత్రమే నిల్వ చేయబడుతుంది.

# restoreDataTitle
source: RESTORE DATA?
te: డేటాను పునరుద్ధరించాలా?

# restoreDataWarning
source: This will REPLACE all your current data with the data from this backup. This action cannot be undone.
te: ఇది మీ ప్రస్తుత డేటాను ఈ బ్యాకప్‌తో భర్తీ చేస్తుంది. ఇది తిరిగి మార్చబడదు.

source: RESTORE NOW
te: ఇప్పుడే పునరుద్ధరించు

# restoreCompleted
source: RESTORE COMPLETED SUCCESSFULLY
te: డేటా పునరుద్ధరణ విజయవంతమైంది

# restoreFailed
source: RESTORE FAILED: {error}
te: పునరుద్ధరణ విఫలమైంది: {error}

# runwayMonths
source: Your savings will last approx. {months} months
te: మీ పొదుపు సుమారు {months} నెలలు సరిపోతుంది

# sustainableRunway
source: Your financial path is sustainable
te: మీ ఆర్థిక ప్రయాణం నిలకడగా ఉంది

# deficitRunway
source: CURRENT BALANCE IN DEFICIT
te: ప్రస్తుత నిల్వ లోటులో ఉంది

source: Calculating runway...
te: రన్ వే లెక్కిస్తోంది...

# failedToLoadLoans
source: Failed to load loans: {error}
te: రుణాలను లోడ్ చేయడం విఫలమైంది: {error}

# loanNameHint
source: e.g. HDFC Gold Loan
te: ఉదాహరణ: HDFC గోల్డ్ లోన్

# engineReducingBalance
source: Engine: Reducing balance (daily)
te: ఇంజిన్: తగ్గించే బ్యాలెన్స్ (రోజువారీ)

# bankType
source: Bank
te: బ్యాంక్

# individualType
source: Individual
te: వ్యక్తిగత

# goldType
source: Gold
te: బంగారం

# carType
source: Car
te: కారు

# homeType
source: Home
te: ఇల్లు

# educationType
source: Education
te: చదువు

source: Settings
te: సెట్టింగులు

source: Select Due Day
te: చెల్లింపు రోజును ఎంచుకోండి

source: DATA EXPORT
te: డేటా ఎగుమతి

source: DANGEROUS TERRITORY
te: ప్రమాదకరమైన ప్రాంతం

source: DATA SEEDING
te: డేటా సీడింగ్

source: RESET ALL DATA
te: మొత్తం డేటాను రీసెట్ చేయండి

source: APP SECURITY
te: యాప్ సెక్యూరిటీ

source: APPEARANCE
te: ప్రదర్శన

# personalizationHeader
source: PERSONALIZATION
te: వ్యక్తిగతీకరణ

source: CURRENCY
te: కరెన్సీ

source: DATA TOOLS
te: డేటా టూల్స్

# trustCenterSubtitle
source: Explicit guarantees & data health
te: స్పష్టమైన హామీలు & డేటా ఆరోగ్యం

# appSecuritySubtitle
source: Set PIN for access
te: యాక్సెస్ కోసం పిన్ సెట్ చేయండి

# appearanceSubtitle
source: Switch between Light, Dark, or System theme
te: లైట్, డార్క్ లేదా సిస్టమ్ థీమ్ మధ్య మారండి

# dataExportSubtitle
source: One-tap export (history, budgets, insights)
te: వన్-టాప్ ఎగుమతి (చరిత్ర, బడ్జెట్లు, అంతర్దృష్టులు)

# resetApplicationSubtitle
source: Clear all data and start fresh
te: అన్ని డేటాను క్లియర్ చేసి కొత్తగా ప్రారంభించండి

# seedDataSubtitle
source: Populate app with demo entries
te: డెమో ఎంట్రీలతో యాప్‌ను పూరించండి

# ritualComplete
source: Ritual complete. Rest well.
te: రిచువల్ పూర్తయింది. విశ్రాంతి తీసుకోండి.

source: DAY RITUAL
te: డే రిచువల్

source: Daily Review
te: రోజువారీ సమీక్ష

# loggedEntriesToday
source: You've logged {count} entries today.
te: ఈరోజు మీరు {count} లావాదేవీలను నమోదు చేశారు.

# underTarget
source: {amount} under target
te: {amount} లక్ష్యం కంటే తక్కువ

# overTarget
source: {amount} over target
te: {amount} లక్ష్యం కంటే ఎక్కువ

source: Finish Daily Review
te: రోజువారీ సమీక్షను ముగించండి

source: Still Day?
te: ఇంకా రోజు ముగియలేదా?

# noTransactionsTodayDescription
source: No transactions logged today. If you're all set, we'll see you tomorrow.
te: ఈరోజు ఎటువంటి లావాదేవీలు నమోదు కాలేదు. అంతా సిద్ధంగా ఉంటే, రేపు కలుద్దాం.

source: Close Day
te: రోజును ముగించండి

source: DATA SOVEREIGNTY
te: డేటా సార్వభౌమాధికారం

# dataSovereigntyDescription
source: Complete data portability. Export your entire history in open formats anytime you want.
te: పూర్తి డేటా పోర్టబిలిటీ. మీకు నచ్చినప్పుడల్లా మీ మొత్తం హిస్టరీని ఓపెన్ ఫార్మాట్లలో ఎగుమతి చేసుకోండి.

source: ONE-TAP ARCHIVE
te: వన్-టాప్ ఆర్కైవ్

# oneTapArchiveDescription
source: Create a complete snapshot of your financial history, budgets, and AI insights in a secure JSON format.
te: మీ ఆర్థిక హిస్టరీ, బడ్జెట్లు మరియు AI అంతర్దృష్టుల యొక్క పూర్తి స్నాప్‌షాట్‌ను సురక్షితమైన JSON ఫార్మాట్‌లో సృష్టించండి.

source: EXPORT NOW
te: ఇప్పుడే ఎగుమతి చేయి

source: RESTORE BACKUP
te: బ్యాకప్‌ను పునరుద్ధరించండి

# restoreBackupSubtitle
source: Import data from a previous export
te: మునుపటి ఎగుమతి నుండి డేటాను దిగుమతి చేయండి

# individualReports
source: INDIVIDUAL REPORTS (CSV / PDF)
te: వ్యక్తిగత నివేదికలు (CSV / PDF)

source: TRANSACTIONS
te: లావాదేవీలు

# transactionsSubtitle
source: Expenses, income (CSV)
te: ఖర్చులు, ఆదాయం (CSV)

source: PDF REPORT
te: PDF నివేదిక

# pdfReportSubtitle
source: Printable financial report
te: ముద్రించదగిన ఆర్థిక నివేదిక

# budgetsSubtitle
source: Limits and targets (CSV)
te: పరిమితులు మరియు లక్ష్యాలు (CSV)

source: AI INSIGHTS
te: AI అంతర్దృష్టులు

# aiInsightsSubtitle
source: Health analysis (CSV)
te: ఆరోగ్య విశ్లేషణ (CSV)

# loansSubtitle
source: Borrowing details (CSV)
te: రుణ వివరాలు (CSV)

source: DATE RANGE
te: తేదీ పరిధి

source: All Time
te: మొత్తం సమయం

# dataOwnershipNotice
source: TrueLedger never retains a copy of your data on its servers. You are the sole custodian of your financial history.
te: ట్రూలెడ్జర్ మీ డేటా కాపీని తన సర్వర్‌లలో ఎప్పుడూ ఉంచుకోదు. మీ ఆర్థిక హిస్టరీకి మీరే ఏకైక సంరక్షకులు.

source: ENCRYPT BACKUP
te: బ్యాకప్‌ను ఎన్‌క్రిప్ట్ చేయండి

# encryptBackupSubtitle
source: Enter a password to encrypt this file.
te: ఈ ఫైల్‌ని ఎన్‌క్రిప్ట్ చేయడానికి పాస్‌వర్డ్‌ను నమోదు చేయండి.

source: PASSWORD
te: పాస్‌వర్డ్

source: DECRYPT
te: డీక్రిప్ట్

source: DECRYPT BACKUP
te: బ్యాకప్‌ను డీక్రిప్ట్ చేయండి

# backupCreated
source: CREATE BACKUP
te: బ్యాకప్‌ను సృష్టించండి

# exportSaved
source: EXPORT SAVED TO {path}
te: ఎగుమతి ఇక్కడ సేవ్ చేయబడింది: {path}

source: FULL DATA EXPORT COMPLETED
te: పూర్తి డేటా ఎగుమతి పూర్తయింది

# exportFailed
source: EXPORT FAILED: {error}
te: ఎగుమతి విఫలమైంది: {error}

source: NO DATA FOUND TO EXPORT
te: ఎగుమతి చేయడానికి ఎటువంటి డేటా కనుగొనబడలేదు

# exportSuccessful
source: {type} EXPORTED SUCCESSFUL
te: {type} విజయవంతంగా ఎగుమతి చేయబడింది

# pdfGenerated
source: PDF REPORT GENERATED SUCCESSFULLY
te: PDF నివేదిక విజయవంతంగా రూపొందించబడింది

source: RESTORE SUCCESSFUL
te: పునరుద్ధరణ విజయవంతమైంది

# restoreFailedDetailed
source: RESTORE FAILED: {error}
te: పునరుద్ధరణ విఫలమైంది: {error}

source: RESTORE UNDONE
te: పునరుద్ధరణ రద్దు చేయబడింది

# errorDuringRestore
source: ERROR DURING RESTORE: {error}
te: పునరుద్ధరణ సమయంలో లోపం: {error}

# restoreReplaceWarning
source: This will REPLACE all your current data with the backup file.
te: ఇది మీ ప్రస్తుత డేటాను బ్యాకప్ ఫైల్‌తో భర్తీ చేస్తుంది.

# restoreAutoBackupNotice
source: • Current state will be AUTO-BACKUPED. • Action can be UNDONE immediately.
te: • ప్రస్తుత స్థితి ఆటోమేటిక్‌గా బ్యాకప్ చేయబడుతుంది. • ఈ చర్యను వెంటనే రద్దు చేయవచ్చు.

source: RESTORE
te: పునరుద్ధరించు

source: Save Encrypted Export
te: ఎన్‌క్రిప్ట్ చేసిన ఎగుమతిని సేవ్ చేయి

source: Save Full Export
te: పూర్తి ఎగుమతిని సేవ్ చేయి

source: Save CSV Export
te: CSV ఎగుమతిని సేవ్ చేయి

# introTrueLedger
source: TrueLedger
te: ట్రూలెడ్జర్

# introTagline
source: Your private financial companion.
te: మీ ప్రైవేట్ ఆర్థిక తోడు.

source: Track Your Wealth
te: మీ సంపదను ట్రాక్ చేయండి

# trackYourWealthDesc
source: See exactly where your money goes with crystal-clear insights.
te: మీ నగదు ఎక్కడికి వెళ్తుందో స్పష్టంగా తెలుసుకోండి.

source: Smart Budgeting
te: స్మార్ట్ బడ్జెటింగ్

# smartBudgetingDesc
source: Set goals and spending limits to save without the sacrifice.
te: త్యాగం లేకుండా ఆదా చేయడానికి లక్ష్యాలను నిర్ణయించుకోండి.

# secureAndPrivate
source: Secure & Private
te: సురక్షితం & ప్రైవేట్

# secureAndPrivateDesc
source: Your data stays on this device. No cloud uploads, no tracking.
te: మీ డేటా ఈ పరికరంలోనే ఉంటుంది. క్లౌడ్ అప్‌లోడ్ లేదు, ట్రాకింగ్ లేదు.

source: What should we call you?
te: మిమ్మల్ని మేము ఏమని పిలవాలి?

# enterYourNameHint
source: Enter your name
te: మీ పేరును నమోదు చేయండి

source: GET STARTED
te: ప్రారంభించండి

# nameTooLong
source: Name is too long (max 20 characters)
te: పేరు చాలా పొడవుగా ఉంది (గరిష్టంగా 20 అక్షరాలు)

# quickAddNote
source: Quick add
te: త్వరిత జత

# netWorthIncreased
source: Great progress! Your net worth has
te: అద్భుతమైన పురోగతి! మీ నికర విలువ

# netWorthDecreased
source: Your net worth has
te: మీ నికర విలువ

# increasedLabel
source: increased
te: పెరిగింది

# decreasedLabel
source: decreased
te: తగ్గింది

# byLabel
source: by
te: ద్వారా

# overLast12Months
source: over the last 12 months.
te: గత 12 నెలల్లో.

source: Failed to refresh dashboard
te: డాష్‌బోర్డ్‌ను రిఫ్రెష్ చేయడం విఫలమైంది

source: Log First Expense
te: మొదటి ఖర్చును నమోదు చేయండి

# logFirstExpenseDesc
source: Track where your money goes
te: మీ డబ్బు ఎక్కడికి వెళ్తుందో ట్రాక్ చేయండి

source: Set a Budget
te: బడ్జెట్‌ను సెట్ చేయండి

# setABudgetDesc
source: Keep your spending in check
te: మీ ఖర్చులను అదుపులో ఉంచుకోండి

source: See Analysis
te: విశ్లేషణ చూడండి

# seeAnalysisDesc
source: Identify spending patterns
te: ఖర్చు చేసే పద్ధతులను గుర్తించండి

# personalizationSubtitle
source: Adaptive defaults & presets
te: అడాప్టివ్ డిఫాల్ట్లు మరియు ప్రిసెట్లు

# currencySubtitle
source: Preferred currency
te: ఇష్టపడే కరెన్సీ

# manageCategoriesSubtitle
source: Add, edit or delete your own categories
te: మీ స్వంత వర్గాలను జోడించండి, సవరించండి లేదా తొలగించండి

# inrRupeeName
source: Indian Rupee
te: భారత రూపాయి

# usdDollarName
source: US Dollar
te: యుఎస్ డాలీర్

# eurEuroName
source: Euro
te: యూరో

# gbpPoundName
source: British Pound
te: బ్రిటిష్ పౌండ్

# jpyYenName
source: Japanese Yen
te: జపనీస్ యెన్

# cadDollarName
source: Canadian Dollar
te: కెనడియన్ డాలర్

# audDollarName
source: Australian Dollar
te: ఆస్ట్రేలియన్ డాలర్

# sgdDollarName
source: Singapore Dollar
te: సింగపూర్ డాలర్

# aedDirhamName
source: UAE Dirham
te: యూఏఈ దిర్హామ్

# sarRiyalName
source: Saudi Riyal
te: సౌదీ రియాల్

# cnyYuanName
source: Chinese Yuan
te: చైనీస్ యువాన్

# krwWonName
source: South Korean Won
te: దక్షిణ కొరియా వోన్

# brlRealName
source: Brazilian Real
te: బ్రెజిలియన్ రియల్

# mxnPesoName
source: Mexican Peso
te: మెక్సికన్ పెసో

source: {year} REVIEW
te: {year} సమీక్ష

source: Annual Reflection
te: వార్షిక ప్రతిబింబం

source: Annual Volume
te: వార్షిక మొత్తం

# totalSpendingReached
source: Total spending reached {amount}.
te: మొత్తం ఖర్చు {amount}కు చేరుకుంది.

# spendingIncrease
source: This is a increase of {amount} ({percentage}%) vs {previousYear}.
te: ఇది {previousYear}తో పోలిస్తే {amount} ({percentage}%) పెరిగింది.

# spendingDecrease
source: This is a decrease of {amount} ({percentage}%) vs {previousYear}.
te: ఇది {previousYear}తో పోలిస్తే {amount} ({percentage}%) తగ్గింది.

# noDataForPreviousYear
source: No data available for {year} to compare.
te: పోల్చడానికి {year} డేటా అందుబాటులో లేదు.

source: Peak Spending
te: గరిష్ట ఖర్చు

# highestSpendingMonth
source: {month} was the year's highest spending month.
te: {month} సంవత్సరంలో అత్యధిక ఖర్చు చేసిన నెల.

# noSignificantPeaks
source: No significant spending peaks found.
te: గణనీయమైన ఖర్చు గరిష్టాలు ఏవీ కనుగొనబడలేదు.

# averageMonthlySpendStabilized
source: Average monthly spend stabilized at {amount}.
te: సగటు నెలవారీ ఖర్చు {amount} వద్ద స్థిరపడింది.

# keepTrackingTrends
source: Keep tracking to see long-term trends.
te: దీర్ఘకాలిక ధోరణులను చూడటానికి ట్రాక్ చేస్తూ ఉండండి.

source: Top Category
te: ప్రధాన వర్గం

# primaryExpenditureCategory
source: {category} was the primary expenditure category.
te: {category} ప్రాథమిక ఖర్చు వర్గం.

# categoryHabitNote
source: High volume in this category often suggests recurring fixed costs or lifestyle habits.
te: ఈ వర్గంలో ఎక్కువ ఖర్చు తరచుగా స్థిర ఖర్చులు లేదా జీవనశైలి అలవాట్లను సూచిస్తుంది.

source: CATEGORY STABILITY
te: వర్గాల స్థిరత్వం

source: STABILITY: {category}
te: స్థిరత్వం: {category}

# spendingStable
source: Spending on {category} remained remarkably consistent throughout {year}.
te: {year} పొడవునా {category} పై ఖర్చు చాలా స్థిరంగా ఉంది.

# spendingFluctuated
source: Spending on {category} showed significant fluctuation.
te: {category} పై ఖర్చు గణనీయమైన హెచ్చుతగ్గులను చూపింది.

# annualReflectionOnDevice
source: Annual reflection generated from your private, on-device financial history.
te: మీ ప్రైవేట్, పరికరంలోని ఆర్థిక చరిత్ర నుండి రూపొందించబడిన వార్షిక ప్రతిబింబం.

source: TRENDS
te: ధోరణులు

source: SPENDING
te: ఖర్చు

source: January
te: జనవరి

source: February
te: ఫిబ్రవరి

source: March
te: మార్చి

source: April
te: ఏప్రిల్

source: May
te: మే

source: June
te: జూన్

source: July
te: జూలై

source: August
te: ఆగస్టు

source: September
te: సెప్టెంబరు

source: October
te: అక్టోబరు

source: November
te: నవంబరు

source: December
te: డిసెంబరు

# janShort
source: JAN
te: జన

# febShort
source: FEB
te: ఫిబ్ర

# marShort
source: MAR
te: మార్చి

# aprShort
source: APR
te: ఏప్రి

# mayShort
source: MAY
te: మే

# junShort
source: JUN
te: జూన్

# julShort
source: JUL
te: జూలై

# augShort
source: AUG
te: ఆగస్టు

# sepShort
source: SEP
te: సెప్టెంబరు

# octShort
source: OCT
te: అక్టోబరు

# novShort
source: NOV
te: నవంబరు

# decShort
source: DEC
te: డిసెంబరు

source: Live Tracking
te: లైవ్ ట్రాకింగ్

source: Burn Rate
te: ఖర్చు రేటు

source: Left of runway
te: బ్యాంకు నిల్వ కాలం

source: Subscription Leakage
te: సబ్‌స్క్రిప్షన్ లీకేజీ

source: Potential Monthly Savings
te: నెలవారీ ఆదా సాధ్యత

source: Monthly Spend
te: నెలవారీ ఖర్చు

source: vs last month
te: గత నెలతో పోలిస్తే

source: Financial Position
te: ఆర్థిక స్థితి

# trackGrowthInsights
source: Track your growth & insights
te: మీ వృద్ధి మరియు అంతర్దృష్టులను ట్రాక్ చేయండి

source: Invested
te: పెట్టుబడి పెట్టినవి

source: All Transactions
te: అన్ని లావాదేవీలు

# cancelMore
source: Cancel {count} more
te: రద్దు చేయి మరో {count}

# savedAmount
source: Saved: {amount}/mo
te: ఆదా చేయబడింది: {amount}/నెల

source: Debt Management
te: రుణ నిర్వహణ

source: Active Loans
te: ప్రస్తుత రుణాలు

# activeWithCount
source: {count} Active
te: {count} ప్రస్తుతం ఉన్నాయి

source: Payoff Strategy
te: రుణ విముక్తి వ్యూహం

source: Active Debt Payoff Plan
te: ప్రస్తుత రుణ విముక్తి ప్రణాళిక

source: No Borrowings
te: రుణాలు లేవు

# debtFreeMessage
source: You are debt-free! Start building your wealth.
te: మీరు రుణముక్తులు! మీ సంపదను నిర్మించడం ప్రారంభించండి.
