Repository: satyakommula96/trueledger
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: TrueLedger
te: ట్రూలెడ్జర్

source: Dashboard
te: డ్యాష్‌బోర్డ్

source: Net Worth
te: నికర విలువ

source: Income
te: ఆదాయం

source: Expenses
te: ఖర్చులు

source: Budgets
te: బడ్జెట్లు

source: Investments
te: పెట్టుబడులు

source: Loans
te: రుణాలు

source: Fixed
te: స్థిరమైన

source: Variable
te: మారేవి

source: Subscription
te: సబ్‌స్క్రిప్షన్

source: Investment
te: పెట్టుబడి

source: Total Balance
te: మొత్తం బ్యాలెన్స్

source: Monthly Summary
te: నెలవారీ సారాంశం

source: Monthly History
te: నెలవారీ చరిత్ర

source: Add Transaction
te: లావాదేవీని జోడించండి

source: Recent Transactions
te: ఇటీవలి లావాదేవీలు

# noTransactions
source: No transactions found
te: లావాదేవీలు ఏవీ కనుగొనబడలేదు

source: Save
te: సేవ్ చేయి

source: Cancel
te: రద్దు చేయి

source: DELETE
te: తొలగించు

source: Edit
te: సవరించు

# billsDueToday
source: {count} BILL DUE TODAY
te: {count} బిల్లు నేడు చెల్లించాలి

# billsDueTodayPlural
source: {count} BILLS DUE TODAY
te: {count} బిల్లులు నేడు చెల్లించాలి

# todayLedger
source: Today's Ledger
te: నేటి లెడ్జర్

source: Payment Calendar
te: పేమెంట్ క్యాలెండర్

source: Month view
te: నెలవారీ వీక్షణ

source: Language
te: భాష

# chooseLanguage
source: Choose your preferred language
te: మీకు నచ్చిన భాషను ఎంచుకోండి

# biometrics
source: Biometric Authentication
te: బయోమెట్రిక్ ప్రమాణీకరణ

# enableBiometrics
source: Use fingerprint or face ID to unlock
te: అన్‌లాక్ చేయడానికి వేలిముద్ర లేదా ఫేస్ ఐడిని ఉపయోగించండి

source: Analysis
te: విశ్లేషణ

source: Monthly Trend
te: నెలవారీ ధోరణి

# spendingAndIncome
source: Spending & Income
te: ఖర్చులు & ఆదాయం

source: Distribution
te: పంపిణీ

source: By Category
te: వర్గం వారీగా

source: Momentum
te: మొమెంటం

# velocityIncreased
source: Velocity increased by
te: వేగం పెరిగింది:

# spendingDecreased
source: Excellent. Spending decreased by
te: అద్భుతం. ఖర్చు తగ్గింది:

source: relative to last period.
te: గత కాలంతో పోలిస్తే.

source: Portfolio
te: పోర్ట్‌ఫోలియో

source: NET PORTFOLIO VALUE
te: నికర పోర్ట్‌ఫోలియో విలువ

source: Diversified
te: వైవిధ్యభరితమైనది

# assetClassesCount
source: {count} ASSET CLASSES
te: {count} ఆస్తి తరగతులు

# activeAssetsCount
source: {count} ACTIVE ASSETS
te: {count} క్రియాశీల ఆస్తులు

source: Allocation
te: కేటాయింపు

source: Asset Classes
te: ఆస్తి తరగతులు

source: My Assets
te: నా ఆస్తులు

source: Full List
te: పూర్తి జాబితా

source: NO ASSETS TRACKED
te: ఆస్తులు ఏవీ ట్రాక్ చేయబడలేదు

# addFirstInvestment
source: Add your first investment to see analysis.
te: విశ్లేషణ చూడటానికి మీ మొదటి పెట్టుబడిని జోడించండి.

source: Good Morning
te: శుభోదయం

source: Good Afternoon
te: శుభ మధ్యాహ్నం

source: Good Evening
te: శుభ సాయంత్రం

source: Daily Streak
te: రోజువారీ స్ట్రీక్

# streakMessage
source: You're on a roll! You've logged transactions for {count} consecutive days. Keep tracking your expenses daily to build a healthy financial habit!
te: మీరు అద్భుతంగా పని చేస్తున్నారు! మీరు వరుసగా {count} రోజులుగా లావాదేవీలను నమోదు చేశారు. ఆరోగ్యకరమైన ఆర్థిక అలవాటును నిర్మించడానికి ప్రతిరోజూ మీ ఖర్చులను ట్రాక్ చేస్తూ ఉండండి!

source: Got it
te: అర్థమైంది

source: CURRENT BALANCE
te: ప్రస్తుత బ్యాలెన్స్

source: Personalization
te: వ్యక్తిగతీకరణ

# personalizationDesc
source: Experience adapts to your patterns
te: అనుభవం మీ నమూనాలకు అనుగుణంగా మారుతుంది

# privateAndLocal
source: PRIVATE & LOCAL
te: ప్రైవేట్ & లోకల్

# privateAndLocalDesc
source: All personalization data is stored only on your device. We never sync or upload your behavior patterns or sensitive financial identifiers.
te: అన్ని వ్యక్తిగతీకరణ డేటా మీ పరికరంలో మాత్రమే నిల్వ చేయబడుతుంది. మేము మీ ప్రవర్తన నమూనాలు లేదా సున్నితమైన ఆర్థిక గుర్తింపులను ఎప్పుడూ సర్వర్‌కు పంపము.

source: DYNAMIC ADAPTATION
te: డైనమిక్ అడాప్టేషన్

# dynamicAdaptationDesc
source: Allow experience to adapt to your patterns.
te: అనుభవం మీ నమూనాలకు అనుగుణంగా మారడానికి అనుమతించండి.

source: ADAPTIVE BEHAVIOR
te: అడాప్టివ్ బిహేవియర్

source: REMEMBER LAST-USED
te: చివరిగా ఉపయోగించినవి గుర్తుంచుకో

# rememberLastUsedDesc
source: Pre-fill category and payment method based on your last entry.
te: మీ చివరి ఎంట్రీ ఆధారంగా వర్గం మరియు చెల్లింపు విధానాన్ని ముందే పూరించండి.

source: TIME-OF-DAY SUGGESTIONS
te: సమయం ఆధారిత సూచనలు

# timeOfDaySuggestionsDesc
source: Suggest categories based on the time and your repetitions.
te: సమయం మరియు మీ పునరావృతాల ఆధారంగా వర్గాలను సూచించండి.

source: SHORTCUT SUGGESTIONS
te: షార్ట్‌కట్ సూచనలు

# shortcutSuggestionsDesc
source: Prompt to create quick-add shortcuts for frequent transactions.
te: తరచుగా చేసే లావాదేవీల కోసం త్వరిత-జోడింపు షార్ట్‌కట్‌లను రూపొందించమని అడగండి.

source: BASELINE REFLECTIONS
te: బేస్‌లైన్ ప్రతిబింబాలు

# baselineReflectionsDesc
source: Show comparisons locally (e.g. 'Higher than your usual Friday').
te: పోలికలను స్థానికంగా చూపండి (ఉదా. 'మీ సాధారణ శుక్రవారం కంటే ఎక్కువ').

source: SALARY CYCLE
te: జీతం చక్రం

source: USUAL PAY DAY
te: సాధారణ జీతం వచ్చే రోజు

# dayNum
source: Day {day}
te: {day}వ రోజు

source: NOT SET
te: సెట్ చేయలేదు

source: QUICK PRESETS
te: త్వరిత ప్రీసెట్లు

# noPresetsYet
source: NO PRESETS CREATED YET.
te: ఇంకా ప్రీసెట్లు సృష్టించబడలేదు.

source: CREATE NEW PRESET
te: కొత్త ప్రీసెట్‌ను సృష్టించండి

source: REMINDERS
te: రిమైండర్లు

source: REMINDER TIME
te: రిమైండర్ సమయం

source: OFF
te: ఆఫ్

source: REMINDER TIME CLEARED
te: రిమైండర్ సమయం క్లియర్ చేయబడింది

# trustAndControl
source: TRUST & CONTROL
te: నమ్మకం & నియంత్రణ

source: RESET PERSONALIZATION?
te: వ్యక్తిగతీకరణను రీసెట్ చేయాలా?

# resetPersonalizationDesc
source: This will wipe all local learned behaviors. Your expense history will remain safe.
te: ఇది అన్ని లోకల్ ప్రవర్తనలను తుడిచివేస్తుంది. మీ ఖర్చు చరిత్ర సురక్షితంగా ఉంటుంది.

source: RESET
te: రీసెట్

source: PERSONALIZATION RESET COMPLETED
te: వ్యక్తిగతీకరణ రీసెట్ పూర్తయింది

source: SELECT PAY DAY
te: జీతం రోజును ఎంచుకోండి

source: CREATE PRESET
te: ప్రీసెట్‌ను సృష్టించండి

# presetLabel
source: LABEL (e.g. Coffee)
te: లేబుల్ (ఉదా. కాఫీ)

source: AMOUNT
te: మొత్తం

source: CATEGORY
te: వర్గం

source: Delete Preset
te: ప్రీసెట్‌ను తొలగించండి

source: All
te: అన్నీ

source: SEARCH LEDGER...
te: లెడ్జర్‌లో వెతకండి...

source: {type} TOTAL
te: {type} మొత్తం

source: NO ENTRIES YET
te: ఇంకా ఎంట్రీలు ఏవీ లేవు

# noTransactionsFoundPeriod
source: NO TRANSACTIONS FOUND FOR THIS PERIOD.
te: ఈ కాలానికి లావాదేవీలు ఏవీ కనుగొనబడలేదు.

source: WEEKLY SUMMARY
te: వారపు సారాంశం

# greatWorkWeek
source: Great work this week.
te: ఈ వారం మీరు అద్భుతంగా పనిచేశారు.

source: Review your week.
te: మీ వారాన్ని సమీక్షించండి.

# underBudgetDays
source: You stayed under budget {count} days.
te: మీరు {count} రోజులు బడ్జెట్ కంటే తక్కువ ఖర్చు చేశారు.

# perfectWeek
source: Perfect week! You stayed under budget every day.
te: పర్ఫెక్ట్ వీక్! మీరు ప్రతిరోజూ బడ్జెట్ కంటే తక్కువగా ఉన్నారు.

# heavyWeek
source: It was a heavy week. Try to track closer next week.
te: ఇది భారమైన వారం. వచ్చే వారం మరింత జాగ్రత్తగా ఉండటానికి ప్రయత్నించండి.

source: Spending Consistency
te: ఖర్చుల స్థిరత్వం

# dailyBenchmark
source: Daily Benchmark: ~{amount}
te: రోజువారీ బెంచ్‌మార్క్: ~{amount}

source: Spending Spike
te: ఖర్చులో పెరుగుదల

# spikeMessage
source: {category} increased by {amount} vs last week.
te: గత వారంతో పోలిస్తే {category} {amount} పెరిగింది.

# newCategoryExpenditure
source: This is a new expenditure category for you.
te: ఇది మీకు కొత్త ఖర్చు వర్గం.

# eyeOnCategoryTrend
source: Keep an eye on this category trend.
te: ఈ వర్గ ధోరణిపై దృష్టి పెట్టండి.

source: Stable Spending
te: స్థిరమైన ఖర్చులు

# noSpikesDetected
source: Zero significant spending spikes detected compared to last week.
te: గత వారంతో పోలిస్తే గణనీయమైన ఖర్చు పెరుగుదలలు ఏవీ కనుగొనబడలేదు.

# spendingStabilizing
source: Your spending habits are stabilizing well.
te: మీ ఖర్చు అలవాట్లు బాగా స్థిరపడుతున్నాయి.

source: Volume Comparison
te: పరిమాణ పోలిక

# reducedSpendingSuccess
source: Success! You reduced spending by {amount}.
te: విజయం! మీరు ఖర్చును {amount} తగ్గించారు.

# increasedSpendingMessage
source: Spending increased by {amount} vs last week.
te: గత వారంతో పోలిస్తే ఖర్చు {amount} పెరిగింది.

# lastWeekVsThisWeek
source: Last Week: {last} | This Week: {current}
te: గత వారం: {last} | ఈ వారం: {current}

source: Primary Category
te: ప్రధాన వర్గం

# largestExpenditureArea
source: {category} was your largest expenditure area.
te: {category} మీ అతిపెద్ద ఖర్చు ప్రాంతం.

# alignWithPriorities
source: Evaluate if this aligns with your current priorities.
te: ఇది మీ ప్రస్తుత ప్రాధాన్యతలతో సరిపోతుందో లేదో అంచనా వేయండి.

source: WEEKLY FOCUS
te: వారపు ఫోకస్

source: Gentle Goal
te: సున్నితమైన లక్ష్యం

# reductionTarget
source: Target a 10% reduction in {category} spending.
te: {category} ఖర్చులో 10% తగ్గింపును లక్ష్యంగా పెట్టుకోండి.

# stayUnderBudgetGoal
source: Attempt to stay under budget for 5 days next week.
te: వచ్చే వారం 5 రోజుల పాటు బడ్జెట్ కంటే తక్కువగా ఉండటానికి ప్రయత్నించండి.

# sustainableProgress
source: Sustainable progress comes from consistent, small adjustments.
te: స్థిరమైన పురోగతి చిన్న చిన్న సర్దుబాట్ల నుండి వస్తుంది.

# reflectionFinancialIntuition
source: Reflection builds financial intuition.
te: ప్రతిబింబం ఆర్థిక అంతర్దృష్టిని నిర్మిస్తుంది.

# newEntry
source: NEW LEDGER ENTRY
te: కొత్త లెడ్జర్ ఎంట్రీ

# newTypeEntry
source: NEW {type}
te: కొత్త {type}

# entryTypeLabel
source: ENTRY TYPE
te: ఎంట్రీ రకం

# transactionAmountLabel
source: TRANSACTION AMOUNT
te: లావాదేవీ మొత్తం

source: BUDGET IMPACT
te: బడ్జెట్ ప్రభావం

# exceedsBudgetBy
source: EXCEEDS BUDGET BY {amount}
te: బడ్జెట్ కంటే {amount} ఎక్కువ

# remainingLabel
source: REMAINING: {amount}
te: మిగిలి ఉన్నది: {amount}

source: TODAY
te: నేడు

source: CATEGORY CLASSIFICATION
te: వర్గీకరణ

source: MANAGE CATEGORIES
te: వర్గాలను నిర్వహించండి

source: AUDIT NOTES
te: ఆడిట్ గమనికలు

# optionalDetailsHint
source: Optional details...
te: ఐచ్ఛిక వివరాలు...

source: COMMIT TO LEDGER
te: లెడ్జర్‌కు జోడించు

# enterAmountError
source: Please enter an amount
te: దయచేసి మొత్తాన్ని నమోదు చేయండి

# validPositiveAmountError
source: Please enter a valid positive amount
te: దయచేసి చెల్లుబాటు అయ్యే సానుకూల మొత్తాన్ని నమోదు చేయండి

# budgetExceededTitle
source: Budget Exceeded: {category}
te: బడ్జెట్ మించిపోయింది: {category}

# budgetWarningTitle
source: Budget Warning: {category}
te: బడ్జెట్ హెచ్చరిక: {category}

# budgetExceededBody
source: You have spent 100% of your {category} budget.
te: మీరు మీ {category} బడ్జెట్‌లో 100% ఉపయోగించారు.

# budgetWarningBody
source: You have reached {percentage}% of your {category} budget.
te: మీరు మీ {category} బడ్జెట్‌లో {percentage}% చేరుకున్నారు.

# editTypeEntry
source: EDIT {type}
te: {type} సవరించండి

# sourceLabel
source: SOURCE
te: మూలం

# labelLabel
source: LABEL
te: లేబుల్

# noteLabel
source: NOTE
te: గమనిక

source: UPDATE ENTRY
te: ఎంట్రీని నవీకరించండి

# amountLabel
source: AMOUNT
te: మొత్తం

source: Entry updated
te: ఎంట్రీ నవీకరించబడింది

# deleteItemTitle
source: DELETE ITEM?
te: అంశాన్ని తొలగించాలా?

# deleteItemContent
source: This action cannot be undone.
te: ఈ చర్యను రద్దు చేయలేము.

source: KEEP
te: ఉంచు

source: Item deleted
te: అంశం తొలగించబడింది

source: UNDO
te: రద్దు చేయి

source: NO RESULTS MATCHED
te: ఫలితాలు ఏవీ సరిపోలలేదు

# categoriesTitle
source: CATEGORIES
te: వర్గాలు

# useCategoryTooltip
source: Use {category}
te: {category} ఉపయోగించండి

# addNewCategoryHint
source: Add new category...
te: కొత్త వర్గాన్ని జోడించండి...

source: NO CATEGORIES YET
te: ఇంకా వర్గాలు ఏవీ లేవు

# addFirstCategory
source: Add your first category for {type}
te: {type} కోసం మీ మొదటి వర్గాన్ని జోడించండి

# categoryAddedTo
source: {category} ADDED TO {type}
te: {category} {type}కు జోడించబడింది

source: {category} DELETED
te: {category} తొలగించబడింది

source: Assets
te: ఆస్తులు

source: Liabilities
te: అప్పులు

# scenarioModeTitle
source: Scenario Mode
te: సినారియో మోడ్

# startLoggingToUseScenario
source: Start logging to use Scenario Mode
te: సినారియో మోడ్ ఉపయోగించడానికి లాగింగ్ ప్రారంభించండి

source: SIMULATION
te: సిమ్యులేషన్

# whatIfSavedMore
source: What if you saved more?
te: మీరు మరింత ఎక్కువ పొదుపు చేస్తే?

source: SELECT CATEGORY
te: వర్గాన్ని ఎంచుకోండి

source: REDUCTION PERCENT
te: తగ్గింపు శాతం

source: PROJECTED YEARLY SAVINGS
te: అంచనా వేయబడిన వార్షిక పొదుపు

# scenarioImpactMessage
source: Cutting your {category} bills by {percent}% frees up {amount} every single month.
te: మీ {category} బిల్లులను {percent}% తగ్గించడం ద్వారా ప్రతి నెలా {amount} ఆదా అవుతుంది.

source: WEALTH IMPACT
te: సంపద ప్రభావం

# oneYearProgress
source: 1 Year Progress
te: 1 సంవత్సరం పురోగతి

# fiveYearMilestones
source: 5 Year Milestones
te: 5 సంవత్సరాల మైలురాళ్ళు

source: TOTAL DUE
te: మొత్తం బకాయి

source: PAID
te: చెల్లించినవి

# netWorthTrackingTitle
source: NET WORTH TRACKING
te: నికర విలువ ట్రాకింగ్

source: TREND
te: ధోరణి

# twelveMonthOverview
source: 12-MONTH OVERVIEW
te: 12-నెలల సారాంశం

source: ASSET ALLOCATION
te: ఆస్తి కేటాయింపు

source: Investment Portfolio
te: పెట్టుబడి పోర్ట్‌ఫోలియో

source: INSIGHT
te: అంతర్దృష్టి

# simulationFailed
source: Simulation failed: {error}
te: సిమ్యులేషన్ విఫలమైంది: {error}

source: Accounts
te: ఖాతాలు

source: Cards
te: కార్డులు

source: More
te: మరిన్ని

source: Saving Goals
te: పొదుపు లక్ష్యాలు

source: Track your milestones
te: మీ మైలురాళ్లను ట్రాక్ చేయండి

source: View past performance
te: గత పనితీరును వీక్షించండి

source: Automation
te: ఆటోమేషన్

source: Recurring transactions
te: పునరావృత లావాదేవీలు

source: Manage spending limits
te: ఖర్చు పరిమితులను నిర్వహించండి

source: SET USER NAME
te: వినియోగదారు పేరును సెట్ చేయండి

source: Enter your name
te: మీ పేరును నమోదు చేయండి

# nameLabel
source: NAME
te: పేరు

source: SELECT CURRENCY
te: కరెన్సీని ఎంచుకోండి

source: Search currency...
te: కరెన్సీని వెతకండి...

source: SELECT DATA SCENARIO
te: డేటా దృశ్యాన్ని ఎంచుకోండి

# fictionalDataDemoOnly
source: Fictional data for demonstration only.
te: ప్రదర్శన కోసం మాత్రమే కల్పిత డేటా.

source: COMPLETE DEMO
te: పూర్తి డెమో

# allFeaturesStreaks
source: All features, including Streaks
te: స్ట్రీక్స్‌తో సహా అన్ని ఫీచర్లు

# generatedScenarioData
source: GENERATED {scenario} DATA SCENARIO
te: {scenario} డేటా దృశ్యం రూపొందించబడింది

source: DELETE ALL DATA?
te: మొత్తం డేటాను తొలగించాలా?

# wipeAllDataWarning
source: This action cannot be undone. All entries, budgets, and cards will be wiped.
te: ఈ చర్యను రద్దు చేయలేము. అన్ని ఎంట్రీలు, బడ్జెట్లు మరియు కార్డులు తుడిచివేయబడతాయి.

source: DELETE ALL
te: మొత్తం తొలగించండి

source: RECORD PAYMENT
te: చెల్లింపును రికార్డ్ చేయండి

source: DUE BALANCE
te: బకాయి మొత్తం

source: AMOUNT TO RECORD
te: రికార్డ్ చేయాల్సిన మొత్తం

source: FULL BALANCE
te: పూర్తి నిల్వ

# minDueAmount
source: MIN: {amount}
te: కనిష్ట: {amount}

source: NO CARDS REGISTERED
te: కార్డులు ఏవీ నమోదు కాలేదు

# limitLabel
source: LIMIT: {amount}
te: పరిమితి: {amount}

# dueLabel
source: DUE
te: బకాయి

source: {percent}% UTILIZED
te: {percent}% ఉపయోగించబడింది

source: AVAILABLE: {amount}
te: అందుబాటులో ఉంది: {amount}

source: TOTAL CARDS DEBT
te: మొత్తం కార్డ్ అప్పు

source: Initializing...
te: ప్రారంభిస్తోంది...

source: Initialization Failed
te: ప్రారంభం విఫలమైంది

source: WEEK
te: వారం

source: Stable
te: స్థిరంగా ఉంది

# remainingAmountLeft
source: {amount} left
te: {amount} మిగిలి ఉంది

source: YOUR GOALS
te: మీ లక్ష్యాలు

source: TOTAL PROGRESS
te: మొత్తం పురోగతి

# savedLabel
source: SAVED
te: పొదుపు చేసినవి

# targetLabel
source: TARGET
te: లక్ష్యం

source: NO GOALS YET
te: ఇంకా లక్ష్యాలు లేవు

# setFirstGoal
source: Set your first saving goal and start building your future!
te: మీ మొదటి పొదుపు లక్ష్యాన్ని నిర్దేశించుకోండి మరియు మీ భవిష్యత్తును నిర్మించుకోవడం ప్రారంభించండి!

source: GOAL ACHIEVED! 🎉
te: లక్ష్యం నెరవేరింది! 🎉

# toGoLabel
source: {amount} TO GO
te: {amount} మిగిలి ఉంది

# archiveLabel
source: ARCHIVE
te: ఆర్కైవ్

# reflectionLabel
source: {year} Reflection
te: {year} ప్రతిబింబం

source: GOAL TRACKING
te: లక్ష్యాల ట్రాకింగ్

source: Retirement Health
te: పదవీ విరమణ ఆరోగ్యం

source: NO DATA AVAILABLE
te: డేటా అందుబాటులో లేదు

source: RETRY
te: మళ్ళీ ప్రయత్నించు

source: SELECT THEME
te: థీమ్‌ను ఎంచుకోండి

source: System Default
te: సిస్టమ్ డిఫాల్ట్

source: Light Mode
te: లైట్ మోడ్

source: Dark Mode
te: డార్క్ మోడ్

source: QUICK ADD
te: త్వరిత జోడింపు

source: CHANGE
te: మార్చు

source: What was this for?
te: ఇది దేనికోసం?

source: SAVE EXPENSE
te: ఖర్చును సేవ్ చేయి

# presetsLabel
source: PRESETS
te: ప్రీసెట్లు

# paymentMethodLabel
source: PAYMENT METHOD
te: చెల్లింపు విధానం

source: Cash
te: నగదు

source: Net Banking
te: నెట్ బ్యాంకింగ్

source: Generic Card
te: సాధారణ కార్డ్

source: Save as shortcut?
te: షార్ట్‌కట్‌గా సేవ్ చేయాలా?

# suggestedLabel
source: Suggested
te: సూచించబడినవి

# basedOnLastEntry
source: Based on your last entry
te: మీ చివరి ఎంట్రీ ఆధారంగా

# basedOnDailyRoutine
source: Based on your daily routine
te: మీ రోజువారీ దినచర్య ఆధారంగా

source: Daily Pattern
te: రోజువారీ నమూనా

source: Based on last record
te: చివరి రికార్డ్ ఆధారంగా

source: NOT NOW
te: ఇప్పుడు కాదు

source: Shortcut saved!
te: షార్ట్‌కట్ సేవ్ చేయబడింది!

# youLogOften
source: You log '{title}' often.
te: మీరు తరచుగా '{title}' నమోదు చేస్తారు.

# recordedBalanceUpdated
source: Recorded! {method} balance updated.
te: రికార్డ్ చేయబడింది! {method} బ్యాలెన్స్ అప్‌డేట్ చేయబడింది.

# validAmountError
source: Please enter a valid amount
te: దయచేసి సరైన మొత్తాన్ని నమోదు చేయండి

source: Transparency Check
te: పారదర్శకత తనిఖీ

# prefilledNotice
source: We pre-filled some values locally to save you typing effort.
te: మీ టైపింగ్ శ్రమను తగ్గించడానికి మేము కొన్ని విలువలను స్థానికంగా ముందే పూరించాము.

# localDataNotice
source: This data never leaves your device.
te: ఈ డేటా మీ పరికరం నుండి ఎప్పటికీ బయటకు వెళ్లదు.

# categoryLabel
source: Category
te: వర్గం

# paymentLabel
source: Payment
te: చెల్లింపు

# dateLabel
source: DATE
te: తేదీ

# yesterdayLabel
source: YESTERDAY
te: నిన్న

# otherLabel
source: OTHER
te: ఇతర

source: INTELLIGENT INSIGHTS
te: మేధోపరమైన అంతర్దృష్టులు

source: AI Powered Analysis
te: AI ఆధారిత విశ్లేషణ

# scenarioModeLabel
source: SCENARIO MODE
te: సినారియో మోడ్

# simulateFuture
source: Simulate your financial future.
te: మీ ఆర్థిక భవిష్యత్తును అనుకరించండి.

source: MINDSET
te: మనస్తత్వం

source: Based on local history.
te: స్థానిక చరిత్ర ఆధారంగా.

# excellentLabel
source: EXCELLENT
te: అద్భుతం

# goodLabel
source: GOOD
te: బాగుంది

# averageLabel
source: AVERAGE
te: సగటు

source: CALIBRATING...
te: క్యాలిబ్రేట్ అవుతోంది...

source: AT RISK
te: ప్రమాదంలో ఉంది

source: Health Score
te: ఆరోగ్య స్కోర్

source: Snooze 7 days
te: 7 రోజులు వాయిదా వేయి

source: Dismiss
te: తీసివేయి

source: MARK PAID
te: చెల్లించినట్లు గుర్తించు

# markedAsPaid
source: {name} marked as paid
te: {name} చెల్లించినట్లు గుర్తించబడింది

# markPaidFailed
source: Failed to mark as paid: {error}
te: చెల్లించినట్లు గుర్తించడంలో విఫలమైంది: {error}

source: RETIREMENT
te: రిటైర్మెంట్

source: MY ACCOUNTS
te: నా ఖాతాలు

source: BREAKDOWN
te: వివరాలు

source: FUTURE WEALTH
te: భవిష్యత్తు సంపద

source: PROJECTION
te: అంచనా

# yearsLabel
source: YEARS
te: సంవత్సరాలు

source: RETIREMENT READY
te: రిటైర్మెంట్ సిద్ధం

source: TOTAL RETIREMENT CORPUS
te: మొత్తం రిటైర్మెంట్ కార్పస్

# latency
source: LATENCY: {time}
te: చివరి అప్‌డేట్: {time}

# estimatedCorpus
source: Estimated corpus at retirement: {amount}
te: రిటైర్మెంట్ వద్ద అంచనా వేసిన కార్పస్: {amount}

source: PROJECTION SETTINGS
te: అంచనా సెట్టింగులు

# currentAgeLabel
source: Current Age
te: ప్రస్తుత వయస్సు

# retirementAgeLabel
source: Retirement Age
te: రిటైర్మెంట్ వయస్సు

# expectedReturn
source: Expected Return Rate
te: ఆశించిన రాబడి రేటు

# percentPa
source: % p.a.
te: % ఏటా

source: UPDATE TARGETS
te: లక్ష్యాలను అప్‌డేట్ చేయి

source: WEALTH ADVISORY
te: సంపద సలహా

# optimalTrajectory
source: Your trajectory is optimal. Maintain current velocity to ensure capital preservation against inflation.
te: మీ పథం సరైనది. ద్రవ్యోల్బణానికి వ్యతిరేకంగా మూలధన పరిరక్షణను నిర్ధారించడానికి ప్రస్తుత వేగాన్ని కొనసాగించండి.

# velocityAdjustment
source: Velocity adjustment recommended. Increasing monthly contributions by 10% will accelerate your goal timeline.
te: వేగం సర్దుబాటు సిఫార్సు చేయబడింది. నెలవారీ విరాళాలను 10% పెంచడం వల్ల మీ లక్ష్య కాలక్రమం వేగవంతం అవుతుంది.

# borrowingsAndLoans
source: BORROWINGS & LOANS
te: రుణాలు & అప్పులు

source: NO ACTIVE BORROWINGS.
te: క్రియాశీల రుణాలు ఏవీ లేవు.

source: REMAINING
te: మిగిలి ఉన్నది

source: REPAID
te: చెల్లించినవి

source: {percent}% REPAID
te: {percent}% చెల్లించారు

source: OF {amount}
te: {amount} లో

source: TOTAL BORROWINGS
te: మొత్తం రుణాలు

source: STRATEGY
te: వ్యూహం

source: Debt Payoff Planner
te: అప్పు తీర్చే ప్లానర్

source: FLEXIBLE
te: ఫ్లెక్సిబుల్

source: RECURRING
te: పునరావృతమయ్యేవి

# dueTodayLabel
source: DUE TODAY
te: నేడు చెల్లించాల్సి ఉంది

# dueTomorrowLabel
source: DUE TOMORROW
te: రేపు చెల్లించాల్సి ఉంది

source: RECORD
te: రికార్డ్

source: AGE
te: వయస్సు

source: EMI
te: ఈఎంఐ (EMI)

source: DUE
te: బకాయి

source: NEW BORROWING
te: కొత్త అప్పు

source: LOAN CLASSIFICATION
te: రుణ వర్గీకరణ

source: CREDITOR / LOAN NAME
te: రుణదాత / రుణ పేరు

source: REMAINING BALANCE
te: మిగిలిన బ్యాలెన్స్

source: TOTAL LOAN
te: మొత్తం రుణం

source: MONTHLY EMI
te: నెలవారీ ఈఎంఐ (EMI)

source: INTEREST RATE
te: వడ్డీ రేటు

source: EXPECTED REPAYMENT DATE
te: ఆశించిన తిరిగి చెల్లింపు తేదీ

source: DUE DATE (DAY OF MONTH)
te: చెల్లింపు తేదీ (నెలలో రోజు)

source: Select Date
te: తేదీని ఎంచుకోండి

source: Select Day
te: రోజును ఎంచుకోండి

source: COMMIT BORROWING
te: అప్పును జోడించు

source: Please fill required fields
te: దయచేసి అవసరమైన అన్ని వివరాలను నింపండి

# remainingCannotExceedTotal
source: Remaining balance cannot exceed total loan
te: మిగిలిన బ్యాలెన్స్ మొత్తం రుణం కంటే ఎక్కువగా ఉండకూడదు

source: UPDATE LOAN
te: రుణం అప్‌డేట్

source: RECORD EMI PAYMENT
te: ఈఎంఐ (EMI) చెల్లింపు రికార్డ్

source: RECORD PREPAYMENT
te: ముందస్తు చెల్లింపు రికార్డ్

source: UPDATE BORROWING
te: అప్పు అప్‌డేట్

source: PAYMENT HISTORY
te: చెల్లింపుల చరిత్ర

# noRecordedPaymentHistory
source: No recorded payment history found.
te: ఎటువంటి చెల్లింపుల చరిత్ర కనుగొనబడలేదు.

source: MARK AS EMI
te: อีఎంఐ (EMI)గా గుర్తించు

source: NOT A PAYMENT
te: చెల్లింపు కాదు

# showAllWithCount
source: SHOW ALL ({count} PAYMENTS)
te: అన్నీ చూపించు ({count} చెల్లింపులు)

source: PAYOFF QUOTE
te: తుది చెల్లింపు అంచనా

source: ESTIMATE
te: అంచనా

source: Valid until today
te: ఈ రోజు వరకు మాత్రమే వర్తిస్తుంది

source: RECONCILE WITH BANK
te: బ్యాంకుతో సరిపోల్చుకోండి

source: PAYOFF BREAKDOWN
te: చెల్లింపు వివరాలు

source: Principal Outstanding
te: అసలు బ్యాలెన్స్

source: Interest Accrued
te: జమ అయిన వడ్డీ

source: Total Quote
te: మొత్తం అంచనా

source: TRUST CENTER
te: ట్రస్ట్ సెంటర్ (నమ్మక కేంద్రం)

source: OUR GUARANTEES
te: మా హామీలు

source: STRICT POLICIES
te: కఠినమైన నిబంధనలు

source: DATA HEALTH
te: డేటా స్థితి

source: BACKUP CONFIDENCE
te: బ్యాకప్ భద్రత

source: LOCAL BACKUPS
te: లోకల్ బ్యాకప్‌లు

source: VIEW FOLDER
te: ఫోల్డర్ చూడండి

source: TOTAL RECORDS
te: మొత్తం రికార్డులు

source: LOCAL BACKUP STATUS
te: లోకల్ బ్యాకప్ స్థితి

# lastBackupLabel
source: Last backup: {time}
te: చివరి బ్యాకప్: {time}

# nextAutoBackup
source: Next automatic backup: At next application launch
te: తదుపరి బ్యాకప్: యాప్ మళ్ళీ తెరిచినప్పుడు

# noLocalBackupsFound
source: NO LOCAL BACKUPS FOUND YET.
te: ఇంకా ఎటువంటి లోకల్ బ్యాకప్‌లు లేవు.

# sqlCipherEncryption
source: TrueLedger uses SQLCipher AES-256 for database encryption on supported platforms.
te: TrueLedger మీ డేటాను సురక్షితంగా ఉంచడానికి SQLCipher AES-256 ఎన్‌క్రిప్షన్‌ను ఉపయోగిస్తుంది.

# productLevelPrivacy
source: PRODUCT-LEVEL PRIVACY GUARANTEES.
te: ఉత్పత్తి-స్థాయి గోప్యతా హామీలు
